of40/tutorials/rheoInterFoam/fluidConveyor_viscous/0/tau.water
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    object      tau;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform (0 0 0 0 0 0);

boundaryField
{
    atmosphere
    {
       type            fixedValue;
       value           uniform (0 0 0 0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0 0 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

     ".*"
    {
       type            extST;
       value           uniform (0 0 0 0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
   
}

// ************************************************************************* //
