of40/tutorials/rheoInterFoam/fluidConveyor_viscous/Allmesh
#!/bin/sh
cd ${0%/*} || exit 1    # run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application=`getApplication`

runApplication blockMesh

runApplication topoSet

runApplication createPatch -overwrite
#------------------------------------------------------------------------------
